tag_list = [
    'Английский язык',
    'Арабский язык',
    'Астрономия',
    'Биология',
    'География',
    'ИЗО',
    'Информатика',
    'Искусство',
    'Испанский язык',
    'История',
    'Итальянский язык',
    'Китайский язык',
    'Лингвистика',
    'Литература',
    'Математика',
    'Менеджмент',
    'Немецкий язык',
    'ОБЖ',
    'Обществознание',
    'Основы предпринимательства',
    'Право',
    'Психология',
    'Робототехника',
    'Русский язык',
    'Технология',
    'Физика',
    'Физическая культура',
    'Французский язык',
    'Химия',
    'Черчение',
    'Экология',
    'Экономика',
    'Японский язык'
]

A = []
c = (len(tag_list) + 2) // 3

i = 0
while True:
    if i < len(tag_list):
        A.append(tag_list[i])
    else:
        break
    if i + c < len(tag_list):
        A.append(tag_list[i + c])
    else:
        break
    if i + c + c < len(tag_list):
        A.append(tag_list[i + c + c])
    else:
        break
    i += 1

for i in A:
    print(f"""    <div class="grid-item">
        <button class="subject" onclick="button_click('{i}')" id="{i}">{i}</button>
    </div>""")