tag_list = [
    'Английский язык',
    'Арабский язык',
    'Астрономия',
    'Биология',
    'География',
    'ИЗО',
    'Информатика',
    'Искусство',
    'Испанский язык',
    'История',
    'Итальянский язык',
    'Китайский язык',
    'Лингвистика',
    'Литература',
    'Математика',
    'Менеджмент',
    'Немецкий язык',
    'ОБЖ',
    'Обществознание',
    'Основы предпринимательства',
    'Право',
    'Психология',
    'Робототехника',
    'Русский язык',
    'Технология',
    'Физика',
    'Физическая культура',
    'Французский язык',
    'Химия',
    'Черчение',
    'Экология',
    'Экономика',
    'Японский язык'
]

A = []
c = (len(tag_list) + 2) // 3

print(len(tag_list))

i = 0
while i < c:
    A.append(tag_list[i])
    A.append(tag_list[i + c])
    A.append(tag_list[i + c + c])
    print(i, i + c, i + c + c)
    i += 1

num = 1
for i in A:
    print(f"""    <div class="grid-item">
        <button class="subject" onclick="button_click({num})" id='{num}'>{i}</button>
    </div>""")
    num += 1